snlkuharlocal/src/Documents/ДоступКИТ_Ресурсам/ДоступКИТ_Ресурсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоступКИТ_Ресурсам</name>
  <registerRecords>InformationRegister.ДоступкИТ_Ресурсам</registerRecords>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравоДоступа</name>
    <type>
      <types>EnumRef.ПраваДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доступ</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИТ_Ресурс</name>
      <type>
        <types>CatalogRef.ИТ_Ресурсы</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ДоступКИТ_Ресурсам/Forms/ФормаДокумента/Module.bsl
//// ПРОВЕРКА ЗАПОЛНЕНИЯ ПОЛЕЙ ТЧ //////////////////////////////////////////////////////
&НаСервере
Функция ЗаполненыВсеДатыВыполненияСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗДоступ", Объект.Доступ.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Доступ.ДатаВыполнения КАК ДатаВыполнения
	|ПОМЕСТИТЬ Доступ
	|ИЗ
	|	&ТЗДоступ КАК Доступ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доступ.ДатаВыполнения КАК ДатаВыполнения
	|ИЗ
	|	Доступ КАК Доступ
	|ГДЕ
	|	Доступ.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Рез.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполненыВсеПоляТабличнойЧасти()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗДоступ", Объект.Доступ.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Доступ.Исполнитель КАК Исполнитель,
	|	Доступ.Сотрудник КАК Сотрудник,
	|	Доступ.ИТ_Ресурс КАК ИТ_Ресурс,
	|	Доступ.ДатаВыполнения КАК ДатаВыполнения
	|ПОМЕСТИТЬ Доступ
	|ИЗ
	|	&ТЗДоступ КАК Доступ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доступ.Исполнитель КАК Исполнитель,
	|	Доступ.Сотрудник КАК Сотрудник,
	|	Доступ.ИТ_Ресурс КАК ИТ_Ресурс,
	|	Доступ.ДатаВыполнения КАК ДатаВыполнения
	|ИЗ
	|	Доступ КАК Доступ
	|ГДЕ
	|	(Доступ.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ Доступ.Сотрудник = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ИЛИ Доступ.Исполнитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ИЛИ Доступ.ИТ_Ресурс = ЗНАЧЕНИЕ(Справочник.ИТ_Ресурсы.ПустаяСсылка))";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Рез.Пустой() Тогда
		Возврат Ложь;    // ВСЕ ПОЛЯ НЕ ЗАПОЛНЕНЫ
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
//// ПРОВЕРКА ЗАПОЛНЕНИЯ ПОЛЕЙ ТЧ //////////////////////////////////////////////////////

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ОтветственноеЛицо) Тогда
		Сообщить("Не заполнено <Ответственное лицо>");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПравоДоступа) Тогда
		Сообщить("Не заполнено <Право доступа>");
		Отказ = Истина;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////
	
	Если НЕ ЗаполненыВсеПоляТабличнойЧасти() Тогда
		Сообщить("Не заполнены ВСЕ поля табличной части <Доступ>");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностью();
КонецПроцедуры

/////////// ПРИ ИЗМЕНЕНИИ ////////////////////////////////////////////////
&НаКлиенте
Процедура ДоступДатаВыполненияПриИзменении(Элемент)
	
	ТекущаяСтрока = Объект.Доступ.НайтиПоИдентификатору(Элементы.Доступ.ТекущаяСтрока);
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаВыполнения) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Исполнитель) Тогда
		ТекущаяСтрока.Исполнитель = ПараметрыСеанса.Пользователь.Физлицо;
	КонецЕсли;
	
	Объект.Отработано = ЗаполненыВсеДатыВыполненияСервере();
	УстановитьТолькоПросмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработаноПриИзменении(Элемент)
	УстановитьТолькоПросмотр();
КонецПроцедуры
/////////// ПРИ ИЗМЕНЕНИИ ////////////////////////////////////////////////

&НаКлиенте
Процедура УстановитьТолькоПросмотр(ИсключаяОтработано = Истина)
	
	Для Каждого Элемент из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") ИЛИ ТипЗнч(Элемент) = Тип("КнопкаФормы")
			ИЛИ ТипЗнч(Элемент) = Тип("ДополнениеЭлементаФормы") Тогда
			Продолжить;
		КонецЕсли;
		Если ИсключаяОтработано И Элемент.Имя = "Отработано" Тогда
			Продолжить;
		КонецЕсли;
		Элемент.ТолькоПросмотр = Объект.Отработано;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностью()
	
	ТолькоПросмотр = НЕ ПолучитьПолномочиеПользователя("РедактированиеДоступаКИТРесурсам");
	
	Если НЕ ТолькоПросмотр Тогда
		УстановитьТолькоПросмотр();
	КонецЕсли;
	
КонецПроцедуры
